app/Repositories/Eloquent/EloquentImageRepository.php

insert into `images` (`description`, `category_id`, `name`, `user_id`, `updated_at`, `created_at`) values ('say good.', '43', 'ZRKYmKTloboEqlDkwcHzaWvptgE7gINbhau7CuUv.jpeg', '1', '2018-01-30 00:05:51', '2018-01-30 00:05:51')
---
    public function store($request)
    {
        // Save image
        $path = Storage::disk('images')->put('', $request->file('image'));
        // Save thumb
        $image = InterventionImage::make($request->file('image'))->widen(500);
        Storage::disk('thumbs')->put($path, $image->encode());
        // Save in base
        $image = new Image;
        $image->description = $request->description;
        $image->category_id = $request->category_id;
        $image->name = $path;
        $image->user_id = auth()->id();
        $image->save();

select `name` from `images`
---
    public function getOrphans()
    {
        $files = collect(Storage::disk('images')->files());
        $images = Image::select('name')->get()->pluck('name');