app/Http/Controllers/HomeController.php

select * from `images` limit 8 offset 0
select count(*) as aggregate from `images`
---
    public function index()
    {
        $images = Image::paginate(config('app.pagination'));