app/Http/Controllers/ImageController.php

select * from `categories` where `slug` = 'paysages' limit 1
select count(*) as aggregate from `images` where `category_id` = '1'
---
    public function category($category)
    {
        //
        //

        $category = Category::where('slug', $category)->first();
        $images = Image::where('category_id', $category->id )->paginate(config('app.pagination'));